Autodesk.Revit.DB.SchedulableField.IsCustomFieldWithValidServer
Identifies if this is a Autodesk.Revit.DB.ScheduleFieldType.CustomField
and if there is added an instance of a Autodesk.Revit.DB.ICustomFieldServer to the custom field service.
Returns:
Returns true if this is a Autodesk.Revit.DB.ScheduleFieldType.CustomField
and if there is added an instance of a Autodesk.Revit.DB.ICustomFieldServer to the custom field service.
Since:
2013

Autodesk.Revit.DB.SchedulableField.GetName(Autodesk.Revit.DB.Document)
Gets the name of the field.
document:
The document in which the field will be used.
Returns:
The name of the field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The parameter doesn't exist in document.
Since:
2013

Autodesk.Revit.DB.SchedulableField.GetCustomFieldData
Gets the data associated with this custom field. If this field isn't a Autodesk.Revit.DB.ScheduleFieldType.CustomField will return null.
Returns:
Returns the data associated with this custom field. If this field isn't a Autodesk.Revit.DB.ScheduleFieldType.CustomField will return null.
Since:
2024

Autodesk.Revit.DB.SchedulableField.ParameterId
The ID of the parameter displayed by the field.
Remarks:
Most non-calculated field types require a parameter ID.
The Count field doesn't have a parameter ID.
The parameter ID, or InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.SchedulableField.#ctor(System.Guid)
Creates a new SchedulableField.
customFieldId:
The Guid that identifies the custom field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided guid doens't represent a valid custom field.
Since:
2024

Autodesk.Revit.DB.SchedulableField.#ctor(Autodesk.Revit.DB.ScheduleFieldType,Autodesk.Revit.DB.ElementId)
Creates a new SchedulableField.
fieldType:
The type of data displayed by the field.
parameterId:
The ID of the parameter displayed by the field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldType is not a schedulable field type
-or-
The fieldType can't be CustomField. To create a CustomField, you should use the constructor which receives the custom field server id as a parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.SchedulableField.#ctor(Autodesk.Revit.DB.ScheduleFieldType)
Creates a new SchedulableField.
fieldType:
The type of data displayed by the field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldType is not a schedulable field type
-or-
The fieldType can't be CustomField. To create a CustomField, you should use the constructor which receives the custom field server id as a parameter.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013